_Rarzrabotki/Rarus/USO2/Reports/УСОERP_ОбъемноКалендарныйПланГрафик_НовыйВариант.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>УСОERP_ОбъемноКалендарныйПланГрафик_НовыйВариант</Name>
		</Properties>
	</Report>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УтверждениеКалендарногоПланаГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УтверждениеКалендарногоПланаГрафика</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВерсииПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыУтвержденияКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботыПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботыПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаДлительности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммарнаяРабота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принципал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Reports/УСОERP_ОбъемноКалендарныйПланГрафик_НовыйВариант/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт 
	
	Настройки.События.ПриСозданииНаСервере = Истина;
	
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - УправляемаяФорма - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "УправляемаяФорма.ПриСозданииНаСервере" в синтакс-помощнике.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	Параметры = ЭтаФорма.Параметры;
	
	Если Параметры.Свойство("ПараметрКоманды")
			И Параметры.Свойство("ОписаниеКоманды")
			И Параметры.ОписаниеКоманды.Свойство("ДополнительныеПараметры") Тогда
		
		Если Параметры.ОписаниеКоманды.ДополнительныеПараметры.Свойство("ДокументУтверждения") Тогда
			
			ЭтаФорма.ФормаПараметры.Отбор.Вставить("ДокументУтверждения", Параметры.ПараметрКоманды);
			ЭтаФорма.ФормаПараметры.Отбор.Вставить("ОбъектСтроительства",Параметры.ПараметрКоманды.ОбъектСтроительства);
			ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
			
		КонецЕсли;          
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииНастроекОтчета(НастройкиОтчета, НастройкиВариантов) Экспорт
	
	НастройкиОтчета.ПоказыватьНастройкиДиаграммыНаФормеОтчета = Ложь;
	
КонецПроцедуры

Процедура ОбновитьНастройкиНаФорме(НастройкиОтчета, НастройкиСКД, Форма) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	НастройкиКомпоновки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрыДанных = НастройкиКомпоновки.ПараметрыДанных;
	
	ДокументУтверждения = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДокументУтверждения")).Значение;
	РазделятьОбъемПоСтрокам = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РазделятьОбъемПоСтрокам")).Значение;
	
	ПараметрПериодичность = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Периодичность"));
	
	Если ПараметрПериодичность <> Неопределено И ПараметрПериодичность.Значение <> Неопределено
			И ПараметрПериодичность.Значение <> Перечисления.Периодичность.ПустаяСсылка()
			И ПараметрПериодичность.Использование Тогда 
		Периодичность = ПараметрПериодичность.Значение;
	Иначе 
		Периодичность = Неопределено;
	КонецЕсли;
	
	Если Не ПараметрПериодичность = Неопределено И Периодичность = Неопределено Тогда 
		ПараметрПериодичность.Использование = Истина;
		ПараметрПериодичность.Значение = Перечисления.Периодичность.ПустаяСсылка();
	КонецЕсли;
	
	Если ДокументУтверждения = Неопределено Тогда 
		ДокументУтверждения = Документы.УСОERP_УтверждениеКалендарногоПланаГрафика.ПустаяСсылка();
	КонецЕсли;
	
	СценарийПланирования = ДокументУтверждения.КопияСценария;
	
	НастройкиКомпоновки.ПараметрыВывода.Элементы.Найти("Заголовок").Значение = СтрШаблон(
		"%1 (№ %2 от %3)",
		СценарийПланирования,
		СценарийПланирования.НомерВерсии,
		Формат(СценарийПланирования.ДатаСохранения, "ДФ=dd.MM.yyyy"));
	
	Если Периодичность = Неопределено Тогда 
		ПараметрИтоги = НастройкиКомпоновки.ПараметрыВывода.Элементы.Найти("ГоризонтальноеРасположениеОбщихИтогов");
		
		Если Не ПараметрИтоги = Неопределено Тогда 
			ПараметрИтоги.Значение = РасположениеИтоговКомпоновкиДанных.Нет;
			ПараметрИтоги.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаОтчета", ПолучитьТаблицуДляОтчета(ДокументУтверждения, Периодичность, РазделятьОбъемПоСтрокам));
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных();
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент();
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТаблицуДляОтчета(ДокументУтверждения, Периодичность, РазделятьОбъемПоСтрокам)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Запрос.УстановитьПараметр("ДокументУтверждения", ДокументУтверждения);
	Запрос.УстановитьПараметр("Периодичность",       Периодичность);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_СтроительныеРаботы.Ссылка КАК СтроительнаяРабота,
	|	УСОERP_СтроительныеРаботы.ДатаНачала КАК ДатаНачала,
	|	УСОERP_СтроительныеРаботы.ДатаОкончания КАК ДатаОкончания,
	|	УСОERP_СтроительныеРаботы.ГрафикРаботы КАК ГрафикРаботы,
	|	НАЧАЛОПЕРИОДА(УСОERP_СтроительныеРаботы.ДатаНачала, ДЕНЬ) КАК ДатаНачалаПоГрафику,
	|	НАЧАЛОПЕРИОДА(УСОERP_СтроительныеРаботы.ДатаОкончания, ДЕНЬ) КАК ДатаОкончанияПоГрафику,
	|	УСОERP_СтроительныеРаботы.ОбъемРаботы КАК ОбъемРаботы,
	|	УСОERP_СтроительныеРаботы.ЕдиницаОбъема КАК ЕдиницаОбъема
	|ПОМЕСТИТЬ ВТ_ФормированиеГрафика
	|ИЗ
	|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|ГДЕ
	|	НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
	|	И УСОERP_СтроительныеРаботы.Владелец = ВЫРАЗИТЬ(&ДокументУтверждения КАК Документ.УСОERP_УтверждениеКалендарногоПланаГрафика).КопияСценария
	|	И НЕ УСОERP_СтроительныеРаботы.СуммарнаяРабота
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтроительнаяРабота,
	|	ГрафикРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ФормированиеГрафика.СтроительнаяРабота КАК СтроительнаяРабота
	|ПОМЕСТИТЬ ВТ_СтроительныеРаботы
	|ИЗ
	|	ВТ_ФормированиеГрафика КАК ВТ_ФормированиеГрафика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СтроительнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВТ_ФормированиеГрафика.ДатаНачалаПоГрафику) КАК ДатаНачалаПоГрафику,
	|	МАКСИМУМ(ВТ_ФормированиеГрафика.ДатаОкончанияПоГрафику) КАК ДатаОкончанияПоГрафику
	|ИЗ
	|	ВТ_ФормированиеГрафика КАК ВТ_ФормированиеГрафика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ФормированиеГрафика.ГрафикРаботы КАК ГрафикРаботы
	|ИЗ
	|	ВТ_ФормированиеГрафика КАК ВТ_ФормированиеГрафика";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Если Периодичность = Неопределено Тогда 
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТ_ФормированиеГрафика.СтроительнаяРабота КАК СтроительнаяРабота,
		|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаГрафика,
		|	1 КАК КоличествоДней
		|ПОМЕСТИТЬ ВТ_ДниГрафика
		|ИЗ
		|	ВТ_ФормированиеГрафика КАК ВТ_ФормированиеГрафика";
		
		Запрос.Выполнить();
		
	Иначе 
		ВыборкаДат = РезультатЗапроса[2].Выбрать();
		Если ВыборкаДат.Следующий() Тогда 
			ОбщаяДатаНачала    = ВыборкаДат.ДатаНачалаПоГрафику;
			ОбщаяДатаОкончания = ВыборкаДат.ДатаОкончанияПоГрафику;
		Иначе 
			ОбщаяДатаНачала    = '00010101';
			ОбщаяДатаОкончания = '00010101';
		КонецЕсли;
		
		ИспользуемыеГрафики = РезультатЗапроса[3].Выгрузить().ВыгрузитьКолонку("ГрафикРаботы");
		
		ГрафикиРаботы.СоздатьВТРасписанияРаботыНаПериод(
			МенеджерВТ,
			ИспользуемыеГрафики,
			ОбщаяДатаНачала,
			ОбщаяДатаОкончания);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВТ_ФормированиеГрафика.СтроительнаяРабота КАК СтроительнаяРабота,
		|	РасписанияРаботы.ДатаГрафика КАК ДатаГрафика,
		|	1 КАК КоличествоДней
		|ПОМЕСТИТЬ ВТ_ДниГрафика
		|ИЗ
		|	ВТ_ФормированиеГрафика КАК ВТ_ФормированиеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРасписанияРаботы КАК РасписанияРаботы
		|		ПО ВТ_ФормированиеГрафика.ГрафикРаботы = РасписанияРаботы.ГрафикРаботы
		|			И (РасписанияРаботы.ДатаГрафика >= ВТ_ФормированиеГрафика.ДатаНачалаПоГрафику)
		|			И (РасписанияРаботы.ДатаГрафика <= ВТ_ФормированиеГрафика.ДатаОкончанияПоГрафику)";
		
		Запрос.Выполнить();
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_СтроительныеРаботы.СтроительнаяРабота КАК СтроительнаяРабота,
	|	ЕСТЬNULL(ВложенныйЗапрос.НомерСтроки, 0) КАК НомерСтроки,
	|	ВложенныйЗапрос.ВидЗатрат КАК ВидЗатрат,
	|	ЕСТЬNULL(ВложенныйЗапрос.ВидЗатрат, """") КАК ВидЗатратДляПоиска,
	|	ЕСТЬNULL(ВложенныйЗапрос.Ресурс, ЗНАЧЕНИЕ(Справочник.УСОERP_Ресурсы.ПустаяСсылка)) КАК Ресурс,
	|	ЕСТЬNULL(ВложенныйЗапрос.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ЕСТЬNULL(ВложенныйЗапрос.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ВложенныйЗапрос.Трудоемкость, 0) КАК Трудоемкость,
	|	ЕСТЬNULL(ВложенныйЗапрос.Машиноемкость, 0) КАК Машиноемкость,
	|	ЕСТЬNULL(ВложенныйЗапрос.Упаковка, 0) КАК Упаковка,
	|	УСОERP_СтроительныеРаботы.ДатаНачала КАК ДатаНачала,
	|	УСОERP_СтроительныеРаботы.ДатаОкончания КАК ДатаОкончания,
	|	УСОERP_СтроительныеРаботы.ОбъемРаботы КАК ОбъемРаботы,
	|	УСОERP_СтроительныеРаботы.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	ЕСТЬNULL(ВложенныйЗапрос.РесурсДляОтбора, ЗНАЧЕНИЕ(Справочник.УСОERP_Ресурсы.ПустаяСсылка)) КАК РесурсДляОтбора,
	|	ЕСТЬNULL(ВложенныйЗапрос.НоменклатураДляОтбора, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК НоменклатураДляОтбора,
	|	ЕСТЬNULL(ВложенныйЗапрос.КонструктивДляОтбора, ЗНАЧЕНИЕ(Справочник.УСОERP_Конструктив.ПустаяСсылка)) КАК КонструктивДляОтбора,
	|	ЕСТЬNULL(ВложенныйЗапрос.КоличествоПовторенийОбъема, 1) КАК КоличествоПовторенийОбъема
	|ПОМЕСТИТЬ ВТ_ОбщиеДанные
	|ИЗ
	|	ВТ_ФормированиеГрафика КАК УСОERP_СтроительныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УСОERP_СтроительныеРаботыРесурсы.Ссылка КАК СтроительнаяРабота,
	|			УСОERP_СтроительныеРаботыРесурсы.Ресурс КАК Ресурс,
	|			УСОERP_СтроительныеРаботыРесурсы.Количество КАК Количество,
	|			""Ресурсы"" КАК ВидЗатрат,
	|			УСОERP_СтроительныеРаботыРесурсы.НомерСтроки КАК НомерСтроки,
	|			УСОERP_СтроительныеРаботыРесурсы.Трудоемкость КАК Трудоемкость,
	|			УСОERP_СтроительныеРаботыРесурсы.Машиноемкость КАК Машиноемкость,
	|			УСОERP_СтроительныеРаботыРесурсы.ЗагрузкаПроцент КАК Характеристика,
	|			ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
	|			УСОERP_СтроительныеРаботыРесурсы.Ресурс КАК РесурсДляОтбора,
	|			ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК НоменклатураДляОтбора,
	|			ЗНАЧЕНИЕ(Справочник.УСОERP_Конструктив.ПустаяСсылка) КАК КонструктивДляОтбора,
	|			1 КАК КоличествоПовторенийОбъема
	|		ИЗ
	|			Справочник.УСОERP_СтроительныеРаботы.Ресурсы КАК УСОERP_СтроительныеРаботыРесурсы
	|		ГДЕ
	|			УСОERP_СтроительныеРаботыРесурсы.Ссылка В
	|					(ВЫБРАТЬ
	|						ВТ.СтроительнаяРабота
	|					ИЗ
	|						ВТ_СтроительныеРаботы КАК ВТ)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			УСОERP_СтроительныеРаботыМатериалы.Ссылка,
	|			УСОERP_СтроительныеРаботыМатериалы.Номенклатура,
	|			УСОERP_СтроительныеРаботыМатериалы.КоличествоУпаковокНаОбъемРаботы,
	|			""Материалы"",
	|			УСОERP_СтроительныеРаботыМатериалы.НомерСтроки,
	|			0,
	|			0,
	|			УСОERP_СтроительныеРаботыМатериалы.Характеристика,
	|			ВЫБОР
	|				КОГДА УСОERP_СтроительныеРаботыМатериалы.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|					ТОГДА УСОERP_СтроительныеРаботыМатериалы.Номенклатура.ЕдиницаИзмерения
	|				ИНАЧЕ УСОERP_СтроительныеРаботыМатериалы.Упаковка
	|			КОНЕЦ,
	|			ЗНАЧЕНИЕ(Справочник.УСОERP_Ресурсы.ПустаяСсылка),
	|			УСОERP_СтроительныеРаботыМатериалы.Номенклатура,
	|			ЗНАЧЕНИЕ(Справочник.УСОERP_Конструктив.ПустаяСсылка),
	|			1
	|		ИЗ
	|			Справочник.УСОERP_СтроительныеРаботы.Материалы КАК УСОERP_СтроительныеРаботыМатериалы
	|		ГДЕ
	|			УСОERP_СтроительныеРаботыМатериалы.Ссылка В
	|					(ВЫБРАТЬ
	|						ВТ.СтроительнаяРабота
	|					ИЗ
	|						ВТ_СтроительныеРаботы КАК ВТ)
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			УСОERP_СтроительныеРаботыКонструктивы.Ссылка,
	|			УСОERP_СтроительныеРаботыКонструктивы.Конструктив,
	|			0,
	|			""Конструктивы"",
	|			УСОERP_СтроительныеРаботыКонструктивы.НомерСтроки,
	|			0,
	|			0,
	|			ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
	|			ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка),
	|			ЗНАЧЕНИЕ(Справочник.УСОERP_Ресурсы.ПустаяСсылка),
	|			ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|			УСОERP_СтроительныеРаботыКонструктивы.Конструктив,
	|			1
	|		ИЗ
	|			Справочник.УСОERP_СтроительныеРаботы.Конструктивы КАК УСОERP_СтроительныеРаботыКонструктивы
	|		ГДЕ
	|			УСОERP_СтроительныеРаботыКонструктивы.Ссылка В
	|					(ВЫБРАТЬ
	|						ВТ.СтроительнаяРабота
	|					ИЗ
	|						ВТ_СтроительныеРаботы КАК ВТ)) КАК ВложенныйЗапрос
	|		ПО УСОERP_СтроительныеРаботы.СтроительнаяРабота = ВложенныйЗапрос.СтроительнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДниГрафика.СтроительнаяРабота КАК СтроительнаяРабота,
	|	СУММА(ВТ_ДниГрафика.КоличествоДней) КАК КоличествоДней
	|ПОМЕСТИТЬ ВТ_ВсегоДней
	|ИЗ
	|	ВТ_ДниГрафика КАК ВТ_ДниГрафика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДниГрафика.СтроительнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбщиеДанные.СтроительнаяРабота КАК СтроительнаяРабота,
	|	ВТ_ОбщиеДанные.НомерСтроки КАК НомерСтроки,
	|	ВТ_ОбщиеДанные.ВидЗатратДляПоиска КАК ВидЗатратДляПоиска,
	|	МАКСИМУМ(ВТ_ОбщиеДанные.ОбъемРаботы) КАК ОбъемРаботы,
	|	СУММА(ВТ_ОбщиеДанные.Количество) КАК Количество,
	|	СУММА(ВТ_ОбщиеДанные.Трудоемкость) КАК Трудоемкость,
	|	СУММА(ВТ_ОбщиеДанные.Машиноемкость) КАК Машиноемкость
	|ПОМЕСТИТЬ ВТ_ИтогиКоличество
	|ИЗ
	|	ВТ_ОбщиеДанные КАК ВТ_ОбщиеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОбщиеДанные.СтроительнаяРабота,
	|	ВТ_ОбщиеДанные.НомерСтроки,
	|	ВТ_ОбщиеДанные.ВидЗатратДляПоиска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбщиеДанные.СтроительнаяРабота КАК СтроительнаяРабота,
	|	СУММА(ВТ_ОбщиеДанные.КоличествоПовторенийОбъема) КАК КоличествоПовторенийОбъема
	|ПОМЕСТИТЬ ВТ_КоличествоПовторенийОбъема
	|ИЗ
	|	ВТ_ОбщиеДанные КАК ВТ_ОбщиеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ОбщиеДанные.СтроительнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбщиеДанные.СтроительнаяРабота КАК СтроительнаяРабота,
	|	ВТ_ОбщиеДанные.НомерСтроки КАК НомерСтроки,
	|	ВТ_ОбщиеДанные.ВидЗатрат КАК ВидЗатрат,
	|	ВТ_ОбщиеДанные.ВидЗатратДляПоиска КАК ВидЗатратДляПоиска,
	|	ВТ_ОбщиеДанные.Ресурс КАК Ресурс,
	|	ВТ_ОбщиеДанные.Характеристика КАК Характеристика,
	|	ВТ_ОбщиеДанные.Упаковка КАК Упаковка,
	|	ВТ_ОбщиеДанные.ДатаНачала КАК ДатаНачала,
	|	ВТ_ОбщиеДанные.ДатаОкончания КАК ДатаОкончания,
	|	ВТ_ОбщиеДанные.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	ВТ_ОбщиеДанные.РесурсДляОтбора КАК РесурсДляОтбора,
	|	ВТ_ОбщиеДанные.НоменклатураДляОтбора КАК НоменклатураДляОтбора,
	|	ВТ_ОбщиеДанные.КонструктивДляОтбора КАК КонструктивДляОтбора,
	|	ВТ_ДниГрафика.ДатаГрафика КАК ДатаПоГрафику,
	|	ВТ_ВсегоДней.КоличествоДней КАК ВсегоДней,
	|	ВТ_ИтогиКоличество.ОбъемРаботы КАК ВсегоОбъемРаботы,
	|	ВТ_ИтогиКоличество.Количество КАК ВсегоКоличество,
	|	ВТ_ИтогиКоличество.Трудоемкость КАК ВсегоТрудоемкость,
	|	ВТ_ИтогиКоличество.Машиноемкость КАК ВсегоМашиноемкость,
	|	ВТ_КоличествоПовторенийОбъема.КоличествоПовторенийОбъема КАК КоличествоПовторенийОбъема
	|ИЗ
	|	ВТ_ОбщиеДанные КАК ВТ_ОбщиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДниГрафика КАК ВТ_ДниГрафика
	|		ПО ВТ_ОбщиеДанные.СтроительнаяРабота = ВТ_ДниГрафика.СтроительнаяРабота
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВсегоДней КАК ВТ_ВсегоДней
	|		ПО ВТ_ОбщиеДанные.СтроительнаяРабота = ВТ_ВсегоДней.СтроительнаяРабота
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогиКоличество КАК ВТ_ИтогиКоличество
	|		ПО ВТ_ОбщиеДанные.СтроительнаяРабота = ВТ_ИтогиКоличество.СтроительнаяРабота
	|			И ВТ_ОбщиеДанные.НомерСтроки = ВТ_ИтогиКоличество.НомерСтроки
	|			И ВТ_ОбщиеДанные.ВидЗатратДляПоиска = ВТ_ИтогиКоличество.ВидЗатратДляПоиска
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КоличествоПовторенийОбъема КАК ВТ_КоличествоПовторенийОбъема
	|		ПО ВТ_ОбщиеДанные.СтроительнаяРабота = ВТ_КоличествоПовторенийОбъема.СтроительнаяРабота";
	
	ОтраженныеСтрокиШапки = Новый ТаблицаЗначений();
	ОтраженныеСтрокиШапки.Колонки.Добавить("СтроительнаяРабота");
	
	ОтраженныеСтрокиТЧ = Новый ТаблицаЗначений();
	ОтраженныеСтрокиТЧ.Колонки.Добавить("СтроительнаяРабота");
	ОтраженныеСтрокиТЧ.Колонки.Добавить("НомерСтроки");
	ОтраженныеСтрокиТЧ.Колонки.Добавить("ВидЗатратДляПоиска");
	
	ТаблицаДляОтчета = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДляОтчета.Колонки.Добавить("ОбъемРаботы",   Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(22, 8)));
	ТаблицаДляОтчета.Колонки.Добавить("Количество",    Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(22, 8)));
	ТаблицаДляОтчета.Колонки.Добавить("Трудоемкость",  Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(22, 8)));
	ТаблицаДляОтчета.Колонки.Добавить("Машиноемкость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(22, 8)));
	
	Для Каждого СтрокаТаблицы Из ТаблицаДляОтчета Цикл 
		ФильтрПоискаШапки = Новый Структура();
		ФильтрПоискаШапки.Вставить("СтроительнаяРабота", СтрокаТаблицы.СтроительнаяРабота);
		
		ФильтрПоискаТЧ = Новый Структура();
		ФильтрПоискаТЧ.Вставить("СтроительнаяРабота", СтрокаТаблицы.СтроительнаяРабота);
		ФильтрПоискаТЧ.Вставить("НомерСтроки",        СтрокаТаблицы.НомерСтроки);
		ФильтрПоискаТЧ.Вставить("ВидЗатратДляПоиска", СтрокаТаблицы.ВидЗатратДляПоиска);
		
		ОбъемРаботыВДень   = Окр(СтрокаТаблицы.ВсегоОбъемРаботы / (?(СтрокаТаблицы.ВсегоДней = 0, 1, СтрокаТаблицы.ВсегоДней) * ?(РазделятьОбъемПоСтрокам, СтрокаТаблицы.КоличествоПовторенийОбъема, 1)), 8);
		КоличествоВДень    = Окр(СтрокаТаблицы.ВсегоКоличество / ?(СтрокаТаблицы.ВсегоДней = 0, 1, СтрокаТаблицы.ВсегоДней), 8);
		ТрудоемкостьВДень  = Окр(СтрокаТаблицы.ВсегоТрудоемкость / ?(СтрокаТаблицы.ВсегоДней = 0, 1, СтрокаТаблицы.ВсегоДней), 8);
		МашиноемкостьВДень = Окр(СтрокаТаблицы.ВсегоМашиноемкость / ?(СтрокаТаблицы.ВсегоДней = 0, 1, СтрокаТаблицы.ВсегоДней), 8);
		
		Если ОтраженныеСтрокиШапки.НайтиСтроки(ФильтрПоискаШапки).Количество() = 0 Тогда 
			ОбъемРаботыВДень = ОбъемРаботыВДень + (СтрокаТаблицы.ВсегоОбъемРаботы - (ОбъемРаботыВДень * ?(СтрокаТаблицы.ВсегоДней = 0, 1, СтрокаТаблицы.ВсегоДней) * ?(РазделятьОбъемПоСтрокам, СтрокаТаблицы.КоличествоПовторенийОбъема, 1)));
			ЗаполнитьЗначенияСвойств(ОтраженныеСтрокиШапки.Добавить(), ФильтрПоискаШапки);
		КонецЕсли;
		
		Если ОтраженныеСтрокиТЧ.НайтиСтроки(ФильтрПоискаТЧ).Количество() = 0 Тогда 
			КоличествоВДень    = КоличествоВДень + (СтрокаТаблицы.ВсегоКоличество - (КоличествоВДень * ?(СтрокаТаблицы.ВсегоДней = 0, 1, СтрокаТаблицы.ВсегоДней)));
			ТрудоемкостьВДень  = ТрудоемкостьВДень + (СтрокаТаблицы.ВсегоТрудоемкость - (ТрудоемкостьВДень * ?(СтрокаТаблицы.ВсегоДней = 0, 1, СтрокаТаблицы.ВсегоДней)));
			МашиноемкостьВДень = МашиноемкостьВДень + (СтрокаТаблицы.ВсегоМашиноемкость - (МашиноемкостьВДень * ?(СтрокаТаблицы.ВсегоДней = 0, 1, СтрокаТаблицы.ВсегоДней)));
			
			ЗаполнитьЗначенияСвойств(ОтраженныеСтрокиТЧ.Добавить(), ФильтрПоискаТЧ);
		КонецЕсли;
		
		СтрокаТаблицы.ОбъемРаботы   = ОбъемРаботыВДень;
		СтрокаТаблицы.Количество    = КоличествоВДень;
		СтрокаТаблицы.Трудоемкость  = ТрудоемкостьВДень;
		СтрокаТаблицы.Машиноемкость = МашиноемкостьВДень;
		
		Если Периодичность = Перечисления.Периодичность.Год Тогда 
			СтрокаТаблицы.ДатаПоГрафику = НачалоГода(СтрокаТаблицы.ДатаПоГрафику);
		ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда 
			СтрокаТаблицы.ДатаПоГрафику = НачалоМесяца(СтрокаТаблицы.ДатаПоГрафику);
		ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда 
			СтрокаТаблицы.ДатаПоГрафику = НачалоНедели(СтрокаТаблицы.ДатаПоГрафику);
		ИначеЕсли Периодичность = Перечисления.Периодичность.День Тогда 
			СтрокаТаблицы.ДатаПоГрафику = НачалоДня(СтрокаТаблицы.ДатаПоГрафику);
		КонецЕсли;
	КонецЦикла;
	
	МенеджерВТ.Закрыть();
	
	Возврат ТаблицаДляОтчета;
	
КонецФункции

#КонецОбласти

#КонецЕсли
